blog-posts/2005-09-11-sprinting.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Sprinting</title>
<!-- 2015-10-19 Mon 14:05 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Sprinting</h1>
<p>
September 11th, 2005 -
<a href="http://sachachua.com/blog/p/2972"><a href="http://sachachua.com/blog/p/2972">http://sachachua.com/blog/p/2972</a></a>
</p>

<p>
I really wanted to spend today with Mom, but I realized that I needed
 to prepare for the start of school. My mom (being an absolutely cool
 and wonderful mom) went ahead with her plans to visit the zoo with one
 of the Canadians we hosted three years ago, and I spent the day going
 through my high-priority tasks.
</p>

<p>
Planner really helped keep me on track. I started the day by listing
 all of the things I needed to do in order to prepare for the next two
 days. I arranged them so that I'd be doing related things together,
 and I set times. Then I just plowed through the tasks. Fun!
</p>

<p>
Some thoughts:
</p>

<ul class="org-ul">
<li>I need an audio timer. I can probably use my computer for this.
</li>
</ul>

<blockquote>
<p>
Extra points if I can get it to automatically pick up the details
 from my planner page. This might be good for remind or appt.el&#x2026;
</p>
</blockquote>

<ul class="org-ul">
<li>Suggested review questions are very good for active reading.
</li>
</ul>

<blockquote>
<p>
Unfortunately, my enggpsych text doesn't have them. I currently
 write down my notes on an index card and re-encode them as part of a
 mindmap. I should write myself review questions for flashcard-style
 or fill-in-the-blanks reviews.
</p>
</blockquote>

<ul class="org-ul">
<li>As a teaching assistant, I can skim the text looking for important
</li>
</ul>

<blockquote>
<p>
points. I don't need to score 100% on tests. I just need to find
 ideas to tie into lab exercises.
</p>
</blockquote>

<ul class="org-ul">
<li>I'm running into some problems with my Toastmasters speech on
</li>
</ul>

<blockquote>
<p>
introductions. I initially imagined it with a strong
 personal-coaching slant, plenty of passion, that sort of delivery.
 Thinking about it a bit more, though, I don't think I should sell
 the idea so strongly, given the fact that the audience is older and
 more experienced than I am. I'm currently favoring an advice-seeking
 approach telling my own story instead of focusing on what people
 should do.
</p>
</blockquote>

<ul class="org-ul">
<li>I should work on finding a note-taking style that fits me. I'm
</li>
</ul>

<blockquote>
<p>
moving away from paper again because my 8.5″x11″ binder is a bit too
 big and heavy. I \<sub>might\</sub>_ use index cards to capture diagrams and
 notes that I can't easily describe.
</p>
</blockquote>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
